#### Terraform Format `success`
#### Terraform Init `success`
#### Terraform Plan `success`
#### Terraform Validation `success`
#

<details><summary>Plan Output</summary>
```

terraform
data.cloudflare_zone.domain: Reading...
data.archive_file.lambda_function: Reading...
data.archive_file.lambda_function: Read complete after 0s [id=a0d510611cc052a2ecbc83c2b24fc77ebd78fc62]
data.cloudflare_zone.domain: Read complete after 1s [id=a667ed5c4ff25ade6b9fcfe3a45f843c]
data.aws_iam_policy_document.lambda_policy_doc: Reading...
data.aws_iam_policy_document.lambda_policy_doc: Read complete after 0s [id=3693445097]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.lambda_dynomodb_policy_doc will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_dynomodb_policy_doc" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:UpdateItem",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # data.aws_iam_policy_document.s3_policy_doc will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_policy_doc" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "PublicReadGetObject"

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # aws_apigatewayv2_api.counter will be created
  + resource "aws_apigatewayv2_api" "counter" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "counter"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = (known after apply)

      + cors_configuration {
          + allow_headers = [
              + "*",
            ]
          + allow_methods = [
              + "OPTIONS",
              + "POST",
            ]
          + allow_origins = [
              + "*",
            ]
        }
    }

  # aws_apigatewayv2_integration.lambda will be created
  + resource "aws_apigatewayv2_integration" "lambda" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_route.counter will be created
  + resource "aws_apigatewayv2_route" "counter" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_stage.counter will be created
  + resource "aws_apigatewayv2_stage" "counter" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + tags_all      = (known after apply)
    }

  # aws_dynamodb_table.table will be created
  + resource "aws_dynamodb_table" "table" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "url"
      + id               = (known after apply)
      + name             = "siteVisits"
      + read_capacity    = 5
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = 5

      + attribute {
          + name = "url"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = (known after apply)
          + enabled        = (known after apply)
        }
    }

  # aws_dynamodb_table_item.items["blog.cheo.dev"] will be created
  + resource "aws_dynamodb_table_item" "items" {
      + hash_key   = "url"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + url = {
                  + S = "blog.cheo.dev"
                }
            }
        )
      + table_name = "siteVisits"
    }

  # aws_dynamodb_table_item.items["resume.cheo.dev"] will be created
  + resource "aws_dynamodb_table_item" "items" {
      + hash_key   = "url"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + url = {
                  + S = "resume.cheo.dev"
                }
            }
        )
      + table_name = "siteVisits"
    }

  # aws_iam_role.lambda_counter will be created
  + resource "aws_iam_role" "lambda_counter" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "counterUpdate"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy.lambda_dynamodb_policy will be created
  + resource "aws_iam_role_policy" "lambda_dynamodb_policy" {
      + id     = (known after apply)
      + name   = "counterUpdatePolicy"
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # aws_lambda_function.counter will be created
  + resource "aws_lambda_function" "counter" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "./lambda.zip"
      + function_name                  = "counterUpdate"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "lxpT/oPlSuOwcCL1ifn/NJtU95ojdEKBYXB+cauOZJ0="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_permission.api_gw will be created
  + resource "aws_lambda_permission" "api_gw" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "counterUpdate"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

  # aws_s3_bucket.resume will be created
  + resource "aws_s3_bucket" "resume" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "resume.cheo.dev"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # aws_s3_bucket_policy.resume will be created
  + resource "aws_s3_bucket_policy" "resume" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_website_configuration.resume will be created
  + resource "aws_s3_bucket_website_configuration" "resume" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + index_document {
          + suffix = "index.html"
        }
    }

  # cloudflare_page_rule.https will be created
  + resource "cloudflare_page_rule" "https" {
      + id       = (known after apply)
      + priority = 1
      + status   = "active"
      + target   = "*.resume.cheo.dev/*"
      + zone_id  = "a667ed5c4ff25ade6b9fcfe3a45f843c"

      + actions {
          + always_use_https    = true
          + disable_apps        = false
          + disable_performance = false
          + disable_railgun     = false
          + disable_security    = false
          + disable_zaraz       = false
        }
    }

  # cloudflare_record.resume_cname will be created
  + resource "cloudflare_record" "resume_cname" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "resume"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "a667ed5c4ff25ade6b9fcfe3a45f843c"
    }

  # local_file.outputs will be created
  + resource "local_file" "outputs" {
      + content              = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0744"
      + filename             = "./site/docs/api_url.json"
      + id                   = (known after apply)
    }

Plan: 17 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_gw_url      = (known after apply)
  + bucket_endpoint = (known after apply)
  + bucket_name     = (known after apply)
  + domain_name     = "resume.cheo.dev"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @{{ github.actor }}, Action: `pull_request`*